Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry.Unregister
Unregisters IExtElemChangeBeamSection.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no valid Connections Provider registered.
Since:
2018

Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry.RegisterInterface(Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection)
Registers a IExtElemChangeBeamSection
provider:
IExtElemChangeBeamSection to be registered.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provider object is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is already registered Connections Provider.
Since:
2018

Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
An object that stores IExtElemChangeBeamSection
Since:
2018